<%@ page
    contentType="text/html;charset=UTF-8" 
    pageEncoding="UTF-8"
%><h1>Η διάταξη του Semanlink</h1><div class="graybox">

<!--<p><a href="../../statix/semanlink-config-with-comments.xml">RDF configuration file example</a></p>
 --><h2>Που βρίσκεται η διάταξη της πληροφορίας ;</h2><p>Το αρχείο <strong>Semanlink-config.xml</strong> είναι το βασικό αρχείο διάρθρωσης του servlet του Semanlink και της «αποθήκης δεδομένων» του προγράμματος.</p><p>(Το αρχείο αυτό βρίσκεται στον κατάλογο τον οποίο προσδιορίζουμε μέσω της παραμέτρου «semanlinkDataDir» κατά τον προσδιορισμό των συμφραζομένων της εφαρμογής μας, συμβουλευτείτε [distributionRootDirectory]/READ-ME.htm)</p><p>Το σύνολο της διάρθρωσης του Semanlink εμπεριέχεται στο αρχείο Semanlink-config.xml, εκτός από το μέρος που βρίσκεται στη διαδικασία προσδιορισμού των συμφραζομένων του λογισμικού μας (cf [distributionRootDirectory]/READ-ME.htm), δηλαδή : 
</p><ul>  <li>    το url του servlet μας  </li>  <li>και το μονοπάτι που μας οδηγεί στον μητρικό κατάλογο του αρχείου αυτού (το «semanlinkDataDir»)  </li></ul>
<h2>Βασικός σκοπός του Semanlink-config.xml </h2><p>Μέσω του αρχείου semanlink-config.xml μπορούμε να προσδιορίσουμε :</p><ul>  <li>τους θησαυρούς (το σύνολο των ετικετών)  </li>  <li>και τους «φακέλους δεδομένων» (τους καταλόγους που περιέχουν τα έγγραφα και τα μεταδεδομένα τους)  </li></ul>
<h2>Πότε και πώς το αρχείο αυτό φορτώνεται</h2><ul>  <li>Ο servlet διαβάζει το αρχείο αυτό κατά τη διάρκεια της εκκίνησής του  </li>  <li>Απαραίτητη σημείωση : όταν το αρχείο φορτώνεται χρησιμοποιείται μια βάση ισότιμη του url που λήγει σε κάθετο (/). Επομένως, τα σχετικά Uri με το servlet μπορούν να χρησιμοποιηθούν στο αρχείο.
  </li></ul>

<h2>ΣΥΝΕΧΙΖΕΤΑΙ </h2>
 </div>