<%@ page
    contentType="text/html;charset=UTF-8" 
    pageEncoding="UTF-8"
%>
<h1>Προσθέτοντας μεταδεδομένα στα τοπικά αρχεία</h1>
<div class="graybox">
<p>Δύο προβλήματα προκύπτουν όταν πρόκειται να προσθέσουμε μεταδεδομένα σε τοπικά αρχεία (αρχεία που βρίσκονται αποθηκευμένα στον σκληρό δίσκο του υπολογιστή μας) τα οποία πρόκειται να χρησιμοποιήσουμε στο πλαίσιο μιας διαδικτυακής εφαρμογής, όπως το Semanlink : </p>
<ol>
  <li>τα τοπικά αρχεία δεν έχουν «όμορφα URI» - συνήθως επιθυμούμε να τροποποιήσουμε την τοποθεσία ή το όνομά τους
  </li>
  <li>δεν μπορούμε να χρησιμοποιήσουμε το αρχείο του URI, καθώς οι φυλλομετρητές δεν επιτρέπουν να έχουμε πρόσβαση σε ένα αρχείο από μια σελίδα HTML, εκτός κι αν πρόκειται για μια σελίδα του δίσκου, δηλαδή με ένα URI, όπως αρχειο: ///). Αλλά οι σελίδες που το semanlink δημιουργεί είναι προσβάσιμες με ένα http URL. Αν κάνουμε κλικ σε μια σύνδεση HTML που συνδέεται με ένα αρχείο – πρωτόκολλο η σελίδα δεν θα λειτουργεί (ακόμη κι αν το servlet λειτουργεί στον ίδιο υπολογιστή (localhost).</li>
</ol>
<h2>Τα τοπικά αρχεία δεν έχουν «όμορφα URI» </h2>
<p>Αποθηκεύοντας τα μεταδεδομένα ενός αρχείου κοντά στο αρχείο, σε ένα αρχείο rdf (με όνομα «sl.rdf»), το οποίο τυπικά βρίσκεται στον ίδιο φάκελο και χρησιμοποιεί σχετικά URI, λύνουμε το πρώτο από τα προβλήματα που εκθέσαμε παραπάνω. Αυτό δεν μας επιτρέπει να αλλάξουμε το σύντομο όνομα του αρχείου για το οποίο έχουμε δημιουργήσει μεταδεδομένα, αλλά αν μετακινήσουμε ή αντιγράψουμε τον κατάλογο σε διαφορετική τοποθεσία, τα μεταδεδομένα παραμένουν σε ισχύ.</p>
<p>Όταν το servlet του Semanlink ξεκινάει, φορτώνει όλα τα αρχεία «sl.rdf» στο δίσκο μας. Ωστόσο η αναζήτηση στο σύνολο του δίσκου αυτού του είδους των αρχείων είναι μια διαδικασία πολύ αργή. Κι αυτό διότι θα πρέπει να κάνουμε τις απαραίτητες ρυθμίσεις στο αρχείο Semanlink-configuration.xml, ώστε η αναζήτηση να πραγματοποιηθεί εκεί που υπάρχουν αυτού του είδους τα αρχεία μεταδεδομένων (αυτό γίνεται μέσω των ρυθμίσεων στους φακέλους δεδομένων («DataFolders»), <a href="config.htm">βλέπε ρυθμίσεις Semanlink</a>). </p>
<h2>HTTP URI για αρχεία</h2>
<p>Δεδομένου ότι δεν είναι δυνατό να δημιουργήσουμε μια σύνδεση προς ένα αρχείο πρωτοκόλλου URL από μια σελίδα HTML που εξυπηρετείται από ένα servlet, το Semanlink απονέμει στα τοπικά αρχεία (για τα οποία πρόκειται να δημιουργήσουμε μεταδεδομένα) διευθύνσεις HTTP URL.</p>
<p>Το Semanlink παρέχει πρόσβαση σε κάθε αρχείο του δίσκου μας με ένα URL που ξεκινάει ως [semanlinkURL/έγγραφο. Αυτό για λόγους ασφαλείας αφορά μόνο τα αρχεία των καταλόγων για τα οποία έχουν γίνει οι απαραίτητες ρυθμίσεις στο αρχείο «[semanlinkDataDir]/conf/Semanlink-config.xml».</p>
<p>Εξ’ ορισμού, οι ρυθμίσεις για ένα τέτοιου είδους φάκελο δεδομένων (Data Folder) έχουν ήδη γίνει στο αρχείο Semanlink-config.xml Πρόκειται για τον κατάλογο που βρίσκεται στο «[semanlinkDataDir]/documents».  Ένα αρχείο, όπως «[semanlinkDataDir]/documents/2006/11/file.htm» εξυπηρετείται στο URL «[semanlinkURL/document/2006/11/file.htm»</p>
<p>Αν θέλουμε να χρησιμοποιήσουμε αρχεία ενός άλλου καταλόγου, για παράδειγμα «C: \foodir», μπορούμε να ανοίξουμε το αρχείο «Semanlink-configuration.xml» και να προσθέσουμε μια ιδιότητα slc : dataFolder στο sl:SLModel η οποία προσδιορίζεται ως εξής : </p>
<pre><code>		&lt;slc:dataFolder&gt;<br>			&lt;sl:DataFolder rdf:about=&quot;document/foo&quot;&gt;<br>				&lt;slc:filePath&gt;C:\foodir&lt;/slc:filePath&gt;<br>			&lt;/sl:DataFolder&gt;<br>		&lt;/slc:dataFolder&gt;</code></pre>
<p>Ένα αρχείο «C:\foodir\file.htm» θα εξυπηρετείται στο URL «[semanlinkURL/document/foo/file.htl»</p>
<p><a href="config.htm">Για περισσότερες λεπτομέρειες μπορείτε να συμβουλευτείτε επίσης την ενότητα που αφορά στη διάταξη του Semanlink.</a></p>
<p>Σημείωση : Αν ανοίξετε το "C:\foodir\file.htm" κάνοντας διπλό κλικ, ο φυλλομετρητής σας θα ανοίξει το «file:///C|/foo/file.htm». Κάνοντας κλικ στο Semanlink it δημιουργούνται ορισμένα μεταδεδομένα  σχετικα με το "[semanlinkURL]/document/foo/file.htm" (Αυτό σημαίνει ότι αν έχετε πρόσβαση σε ένα αρχείο με τον «παραδοσιακό τρόπο», χρησιμοποιώντας το OS, μπορείτε εύκολα να δημιουργήσετε τα μεταδεδομένα του).</p>
</div>